{
  "ATULAUTO": {
    "companyCode": "ATULAUTO",
    "name": "Atul Auto Limited (ATULAUTO.NS)",
    "price": "493.55",
    "week52High": "844.40",
    "week52Low": "412.65",
    "downBy": 350.84999999999997,
    "downByPercentage": 41.55021316911416,
    "potentialProfitPercentage": 71.08702259142943,
    "lastUpdated": "2025-04-20T00:15:59.0307427+05:30",
    "dailyChange": "+1.65",
    "dailyChangePercentage": "+(0.34%)",
    "dayRange": "483.35 - 506.90",
    "marketCap": "13.713B",
    "peRatio": "67.98 7.26",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Atul Auto Limited manufactures and sells three-wheeler automobiles in India. It offers passenger and cargo, e-rickshaw, and delivery vans, as well as spare parts and accessories. The company's products are diesel, petrol, CNG, LPG, and electric vehicles. It offers its products under the Atul RIK, Atul Gem, Atul Gemini, Atul Gemi, Atul Elite, Atul Smart, and Atul Shakti brand names. The company exports its products to Bangladesh, Nepal, Cambodia, Myanmar, South Africa, the United Kingdom, Ethiopia, Liberia, Sierra Leone, Tanzania, Ecuador, Bolivia, Guatemala, Honduras, and Mexico. Atul Auto Limited was incorporated in 1986 and is headquartered in Rajkot, India.474March 31Consumer Cyclical   Auto Manufacturers",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "EASEMYTRIP": {
    "companyCode": "EASEMYTRIP",
    "name": "Easy Trip Planners Limited (EASEMYTRIP.NS)",
    "price": "12.30",
    "week52High": "23.90",
    "week52Low": "10.80",
    "downBy": 11.599999999999998,
    "downByPercentage": 48.53556485355648,
    "potentialProfitPercentage": 94.30894308943087,
    "lastUpdated": "2025-04-20T00:15:55.5263705+05:30",
    "dailyChange": "+0.11",
    "dailyChangePercentage": "+(0.90%)",
    "dayRange": "12.00 - 12.38",
    "marketCap": "45.138B",
    "peRatio": "58.57 0.21",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Easy Trip Planners Limited, together with its subsidiaries, operates as an online travel agency in India, the Philippines, Singapore, Thailand, the United Arab Emirates, the United Kingdom, New Zealand, Brazil, the Middle East, and the United States. The company provides reservation and booking services related to travel and tourism through ease-my-trip portal and app or in-house call centre, which includes a range of travel-related products and services, such as airline tickets, hotels, and holiday and travel packages; and train tickets, bus tickets, air charter services, and cab bookings. It also offers travel guides and updates, and other reservation activities. The company was incorporated in 2008 and is based in New Delhi, India.--March 31Consumer Cyclical   Travel Services",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "HDFCBANK": {
    "companyCode": "HDFCBANK",
    "name": "HDFC Bank Limited (HDFCBANK.NS)",
    "price": "1,906.70",
    "week52High": "1,919.70",
    "week52Low": "1,426.80",
    "downBy": 13,
    "downByPercentage": 0.6771891441371047,
    "potentialProfitPercentage": 0.6818062621282844,
    "lastUpdated": "2025-04-20T00:22:21.7754595+05:30",
    "dailyChange": "+28.70",
    "dailyChangePercentage": "+(1.53%)",
    "dayRange": "1,876.70 - 1,919.70",
    "marketCap": "14.59T",
    "peRatio": "21.32 89.42",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "HDFC Bank Limited engages in the provision of banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, Singapore, and Dubai. The company operates in three segments: Treasury, Retail Banking, Wholesale Banking, and Other Banking Services. It accepts savings, salary, current, rural, public provident fund, pension, and demat accounts; fixed and recurring deposits; and safe deposit lockers, as well as offshore accounts and deposits, and overdrafts against fixed deposits. The company also provides personal, home, car, two-wheeler, business, doctor, educational, gold, consumer, and rural loans; loans against properties, securities, mutual funds, rental receivables, and assets; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, healthcare/medical equipment and commercial vehicle finance, dealer finance, and term loans. In addition, it offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, and merchant and cash management services; insurance and investment products. Further, the company provides short term finance, bill discounting, structured finance, export credit, loan repayment, and documents collection services; online and wholesale, mobile, and phone banking services; unified payment interface, immediate payment, national electronic funds transfer, and real time gross settlement services; and channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. It operates branches and automated teller machines in various cities/towns. The company was incorporated in 1994 and is headquartered in Mumbai, India.213,527March 31Financial Services   Banks - Regional",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "MEDANTA": {
    "companyCode": "MEDANTA",
    "name": "Global Health Limited (MEDANTA.NS)",
    "price": "1,269.10",
    "week52High": "1,511.00",
    "week52Low": "935.50",
    "downBy": 241.9000000000001,
    "downByPercentage": 16.009265387160827,
    "potentialProfitPercentage": 19.060751713812945,
    "lastUpdated": "2025-04-20T00:15:48.6581687+05:30",
    "dailyChange": "-26.20",
    "dailyChangePercentage": "(-2.02%)",
    "dayRange": "1,263.10 - 1,298.70",
    "marketCap": "340.864B",
    "peRatio": "67.11 18.91",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Global Health Limited engages in the provision of healthcare services in India. The company primarily offers treatments in the areas of digestive and hepatobiliary sciences, cardiac and cancer care, neurosciences, gastrosciences, musculoskeletal disorders and orthopaedics, renal care, liver transplant, lung transplant, bone marrow transplant, chest surgery, gynaecology and gynaeoncology, paediatric care, obstetrics, plastic, aesthetic and reconstructive surgery, ENT, head and neck surgery, internal medicine, respiratory and sleep medicine, peripheral vascular and endovascular sciences, endocrinology and diabetes, rheumatology and immunology, radiology and imaging, ophthalmology, critical care, dermatology, dentistry, ayurveda, and dietetics and nutrition. It also offers lab tests and diagnostics, homecare and elder care services, telemedicine and air ambulance services, blood bank and e-ICU services, and health plans, as well as operates pharmacies. The company operates a network of hospitals under the Medanta brand. Global Health Limited was incorporated in 2004 and is based in New Delhi, India.9,052March 31Healthcare   Medical Care Facilities",
    "sector": "Healthcare HealthcareHealthcare",
    "industry": "Medical Care Facilities"
  },
  "UNIONBANK": {
    "companyCode": "UNIONBANK",
    "name": "Union Bank of India (UNIONBANK.NS)",
    "price": "126.59",
    "week52High": "172.50",
    "week52Low": "100.81",
    "downBy": 45.91,
    "downByPercentage": 26.614492753623185,
    "potentialProfitPercentage": 36.26668773204834,
    "lastUpdated": "2025-04-20T00:15:52.3957007+05:30",
    "dailyChange": "-0.67",
    "dailyChangePercentage": "(-0.53%)",
    "dayRange": "125.15 - 127.85",
    "marketCap": "966.339B",
    "peRatio": "5.90 21.44",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Union Bank of India provides various banking products and services. It operates through four segments: Treasury Operations, Retail Banking Operations, Corporate and Wholesale Banking, and Other Banking Operations. The company offers savings and current accounts; term deposits; home, vehicle, education, personal, agriculture, and gold loans; loans against the property; and loans for senior citizen and pensioners, as well as products and loans for micro, small, and medium enterprises. It also provides mutual funds; life, non-life, and health insurance products; demat and online trading services; tax saving deposits; government saving schemes; and safe deposit locker and cheque collection services. In addition, the company offers corporate loans, that includes export scheme, line of credit, trade finance, working capital, project financing, and channel finance; debt structuring/restructuring, loan syndication, and structured finance services; cash management, ECGC cover, and foreign exchange services, as well as derivatives; export and import finance services; NRI banking services; and treasury and other products, and remittance services. Further, it provides app, internet, self-service, ATM, and SMS banking services; point of sale terminal and immediate payment services; and debit, credit, gift, and payroll cards. The company was incorporated in 1919 and is headquartered in Mumbai, India.75,866March 31Financial Services   Banks - Regional",
    "sector": "Healthcare Healthcare",
    "industry": ""
  }
}