{
  " NIFTYBEES": {
    "companyCode": " NIFTYBEES",
    "name": "Nippon India ETF Nifty 50 BeES (NIFTYBEES.NS)",
    "price": "268.63",
    "week52High": "293.99",
    "week52Low": "231.30",
    "downBy": 25.360000000000014,
    "downByPercentage": 8.626143746385937,
    "potentialProfitPercentage": 9.440494360272499,
    "lastUpdated": "2025-04-26T23:00:43.5508962+05:30",
    "dailyChange": "-2.32",
    "dailyChangePercentage": "(-0.86%)",
    "dayRange": "266.71 - 272.30",
    "marketCap": "--",
    "peRatio": "22.23 --",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "ABBOTIND": {
    "companyCode": "ABBOTIND",
    "name": "",
    "price": "",
    "week52High": "",
    "week52Low": "",
    "downBy": 0,
    "downByPercentage": 0,
    "potentialProfitPercentage": 0,
    "lastUpdated": "2025-04-26T23:02:21.4655078+05:30",
    "dailyChange": "",
    "dailyChangePercentage": "",
    "dayRange": "",
    "marketCap": "",
    "peRatio": "",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "AKZOINDIA": {
    "companyCode": "AKZOINDIA",
    "name": "Akzo Nobel India Limited (AKZOINDIA.NS)",
    "price": "3,568.20",
    "week52High": "4,674.00",
    "week52Low": "2,420.80",
    "downBy": 1105.8000000000002,
    "downByPercentage": 23.65853658536586,
    "potentialProfitPercentage": 30.99041533546327,
    "lastUpdated": "2025-04-26T23:02:07.3458537+05:30",
    "dailyChange": "+61.70",
    "dailyChangePercentage": "+(1.76%)",
    "dayRange": "3,452.50 - 3,598.90",
    "marketCap": "162.497B",
    "peRatio": "37.73 94.56",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Akzo Nobel India Limited manufactures, distributes, and sells paints and coatings in India and internationally. It offers paints, emulsions, lacquers, and varnishes for interior, exterior, waterproofing, and wood care applications; waterproofing paint products; weathershield paint for institutions/builders/contractors; automotive and specialty, industrial, powder, and marine and protective coatings. The company's products are used in oil and gas, power, infrastructure, and wind energy projects; architecture, automobile, and functional and domestic appliances; automotive OEM coating, consumer electronics coating, vehicle refinishes, and specialty coating businesses; packaging industry, including food, caps and closures, and beer and beverages; and roofing, building, aluminum composite panels, and domestic appliance sectors. It offers its products primarily under the Dulux, Sikkens, International, and Interpon brands. The company was formerly known as ICI India Limited and changed its name to Akzo Nobel India Limited in February 2010. Akzo Nobel India Limited was founded in 1792 and is based in Gurugram, India. Akzo Nobel India Limited is a subsidiary of Imperial Chemical Industries PLC.1,500March 31Basic Materials   Specialty Chemicals",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "ASIANPAINT": {
    "companyCode": "ASIANPAINT",
    "name": "Asian Paints Limited (ASIANPAINT.NS)",
    "price": "2,431.60",
    "week52High": "3,394.90",
    "week52Low": "2,124.75",
    "downBy": 963.3000000000002,
    "downByPercentage": 28.374915314147696,
    "potentialProfitPercentage": 39.61589077150848,
    "lastUpdated": "2025-04-26T23:02:14.5254545+05:30",
    "dailyChange": "-32.80",
    "dailyChangePercentage": "(-1.33%)",
    "dayRange": "2,413.70 - 2,468.70",
    "marketCap": "2.363T",
    "peRatio": "54.94 44.26",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Asian Paints Limited, together with its subsidiaries, engages in the manufacturing, selling, and distribution of paints, coatings, and products related to home decoration and bath fittings in Asia, the Middle East, Africa, and the South Pacific region. The company offers wall coverings; textures painting aids; waterproofing products; wall stickers; mechanized tools; adhesives; modular kitchens and wardrobes; bath fittings and sanitaryware; decorative lighting products; fabrics, furniture, furnishings, and rugs; and unplasticized polyvinyl chloride windows and door systems, as well as personalized interior design, safe painting, and color consulting services. It also provides interior and exterior wall finishes, wood finishes, enamels, tools, undercoats, thinners, and varnishers. The company offers its products under the Asian Paints, SCIB Paints, Apco Coatings, Asian Paints Berger, Taubman, Asian Paints Causeway, and Kadisco Asian Paints brand names through a network of dealers and retail stores, as well as operates asianpaints.com, an online shop. Asian Paints Limited was founded in 1942 and is headquartered in Mumbai, India.9,482March 31Basic Materials   Specialty Chemicals",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "AXISBANK": {
    "companyCode": "AXISBANK",
    "name": "Axis Bank Limited (AXISBANK.NS)",
    "price": "1,166.30",
    "week52High": "1,339.65",
    "week52Low": "933.50",
    "downBy": 173.35000000000014,
    "downByPercentage": 12.93994700108238,
    "potentialProfitPercentage": 14.863242733430518,
    "lastUpdated": "2025-04-26T23:01:01.0153067+05:30",
    "dailyChange": "-40.80",
    "dailyChangePercentage": "(-3.38%)",
    "dayRange": "1,146.00 - 1,179.90",
    "marketCap": "3.74T",
    "peRatio": "12.94 90.15",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Axis Bank Limited, together with its subsidiaries, engages in the provision of various banking and financial products and services. It operates through four segments: Treasury, Retail Banking, Corporate/Wholesale Banking, and Other Banking Business. The Treasury segment is involved in investments in sovereign and corporate debt, and equity and mutual funds, as well as in trading operations, derivative trading, and foreign exchange operations. The Retail Banking segment engages in the provision of lending services to individuals/small businesses; liability products; card services, including credit, debit, and forex cards; internet banking, mobile banking, and ATM services; retail term deposits; financial advisory services; NRI and digital banking services; bill payment and wealth management services; and distribution of third-party product, such as life and non-life insurance, mutual funds, government bonds, etc. The Corporate/Wholesale Banking segment offers business lending, corporate advisory, placements and syndication, project appraisals, current and corporate term deposits, payments, trade finance products, letter of credits, bank guarantees, commercial cards, cash management, project appraisals, and capital market related services. The Other Banking Business segment is involved in para banking activities. It also engages in investments, broking, asset management, and trustee service and payment activities; operation of MSME digital invoice discounting platform; and government small saving schemes and pension schemes. The company operates multiple branches; ATMs; and recyclers in India. It also has international offices with branches in Singapore and Dubai, and representative offices in Dhaka, Dubai, Abu Dhabi, and Sharjah. The company was formerly known as UTI Bank Limited and changed its name to Axis Bank Limited in July 2007. Axis Bank Limited was incorporated in 1993 and is headquartered in Mumbai, India.--March 31Financial Services   Banks - Regional",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "BAJAJ-AUTO": {
    "companyCode": "BAJAJ-AUTO",
    "name": "Bajaj Auto Limited (BAJAJ-AUTO.NS)",
    "price": "8,034.00",
    "week52High": "12,774.00",
    "week52Low": "7,089.35",
    "downBy": 4740,
    "downByPercentage": 37.1066228276186,
    "potentialProfitPercentage": 58.999253174010455,
    "lastUpdated": "2025-04-26T23:02:32.2123029+05:30",
    "dailyChange": "-167.50",
    "dailyChangePercentage": "(-2.04%)",
    "dayRange": "7,965.00 - 8,259.50",
    "marketCap": "2.29T",
    "peRatio": "29.85 269.14",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Bajaj Auto Limited, together with its subsidiaries, engages in the development, manufacture, and distribution of automobiles in India and internationally. The company offers motorcycles, bikes, commercial vehicles, electric two-wheelers, and three-wheeler, as well as related parts. It also exports its products. The company was founded in 1945 and is based in Pune, India.6,192March 31Consumer Cyclical   Auto Manufacturers",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "BAJAJFINSV": {
    "companyCode": "BAJAJFINSV",
    "name": "Bajaj Finserv Ltd. (BAJAJFINSV.NS)",
    "price": "2,045.50",
    "week52High": "2,135.00",
    "week52Low": "1,419.05",
    "downBy": 89.5,
    "downByPercentage": 4.192037470725996,
    "potentialProfitPercentage": 4.375458323148374,
    "lastUpdated": "2025-04-26T23:02:51.8924144+05:30",
    "dailyChange": "-59.50",
    "dailyChangePercentage": "(-2.83%)",
    "dayRange": "2,023.10 - 2,125.00",
    "marketCap": "3.358T",
    "peRatio": "38.46 53.18",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Bajaj Finserv Ltd., through its subsidiaries, engages in the provision of financial services in India. The company operates through Life Insurance, General Insurance, Windpower, Retail Financing, and Investments and Others segments. It offers personal, business, home, home renovation, commercial, car, and gold loans; two- and three-wheeler loans; mortgages; education loans; unsecured and secured loans to small and medium-sized enterprises, micro, small and medium enterprises, and professionals; loans against properties and securities; financing for products, such as consumer electronics, digital, lifecare, furniture, etc.; developer financing; and lease rental discounting products. The company also provides investment products, including fixed deposits, systematic deposit plans, and mutual funds; savings products; life, health, motor, fire, engineering, liabilities, marine, crop, car, two-wheeler, pet, home, travel, and personal accident insurance products; wealth management and retirement planning services; healthcare services comprising wellness, outpatient, and inpatient services; and wallets and credit cards. In addition, it offers pocket subscription plans; bill and recharge services; digital technology services; and trading and demat account, stock broking, margin trading, and HNI and retail broking services. Further, the company owns and operates 138 windmills with total installed capacity of 65.2 megawatts. Bajaj Finserv Ltd. was incorporated in 2007 and is based in Pune, India.92,079March 31Financial Services   Financial Conglomerates",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "BAJAJHLDNG": {
    "companyCode": "BAJAJHLDNG",
    "name": "Bajaj Holdings \u0026 Investment Limited (BAJAJHLDNG.NS)",
    "price": "12,198.00",
    "week52High": "13,238.00",
    "week52Low": "7,659.95",
    "downBy": 1040,
    "downByPercentage": 7.856171627134008,
    "potentialProfitPercentage": 8.52598786686342,
    "lastUpdated": "2025-04-26T23:02:55.4047054+05:30",
    "dailyChange": "-181.00",
    "dailyChangePercentage": "(-1.46%)",
    "dayRange": "11,868.00 - 12,585.00",
    "marketCap": "1.379T",
    "peRatio": "18.08 674.55",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Bajaj Holdings \u0026 Investment Limited operates as a non-banking financial institution-investment and credit company in India. It invests in listed and unlisted securities of companies. The company was incorporated in 1945 and is based in Pune, India.19March 31Financial Services   Asset Management",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "BAJFINANCE": {
    "companyCode": "BAJFINANCE",
    "name": "Bajaj Finance Limited (BAJFINANCE.NS)",
    "price": "9,112.00",
    "week52High": "9,660.00",
    "week52Low": "6,375.70",
    "downBy": 548,
    "downByPercentage": 5.67287784679089,
    "potentialProfitPercentage": 6.0140474100087795,
    "lastUpdated": "2025-04-26T23:02:58.7040578+05:30",
    "dailyChange": "-189.00",
    "dailyChangePercentage": "(-2.03%)",
    "dayRange": "8,990.00 - 9,344.50",
    "marketCap": "5.772T",
    "peRatio": "35.34 257.87",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Bajaj Finance Limited operates as a deposit-taking non-banking financial company in India. The company offers consumer finance products comprising durable, lifestyle, and digital products; EMI cards; two and three-wheeler, and personal loans; loans against fixed deposit; home and gold loans; and extended warranties, retail EMIs, consumer electronics, furniture, e-commerce, and co-branded credit cards and wallets. It also provides secured and unsecured loans to micro, small, and medium enterprises (MSMEs) and SMEs; loans against property, mutual funds, insurance policies, and shares; lease rental discounting, business and professional loans, working capital loans, and term loans; developer finance; and new and used car, and tractor financing. In addition, the company offer commercial and rural lending; public and corporate deposits; loans against securities; and various investment services, including demat services, broking, and margin trade financing. Further, it distributes life, health, and general insurance products. The company was formerly known as Bajaj Auto Finance Limited and changed its name to Bajaj Finance Limited in September 2010. The company was incorporated in 1987 and is based in Pune, India. Bajaj Finance Limited is a subsidiary of Bajaj Finserv Ltd.--March 31Financial Services   Credit Services",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "BANKBEES": {
    "companyCode": "BANKBEES",
    "name": "Nippon India ETF Nifty Bank BeES (BANKBEES.NS)",
    "price": "559.55",
    "week52High": "574.69",
    "week52Low": "477.77",
    "downBy": 15.1400000000001,
    "downByPercentage": 2.634463797873653,
    "potentialProfitPercentage": 2.705745688499705,
    "lastUpdated": "2025-04-26T23:00:50.1075691+05:30",
    "dailyChange": "-5.55",
    "dailyChangePercentage": "(-0.98%)",
    "dayRange": "555.01 - 567.20",
    "marketCap": "--",
    "peRatio": "14.79 --",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "BATAINDIA": {
    "companyCode": "BATAINDIA",
    "name": "Bata India Limited (BATAINDIA.NS)",
    "price": "1,210.80",
    "week52High": "1,633.00",
    "week52Low": "1,140.30",
    "downBy": 422.20000000000005,
    "downByPercentage": 25.85425597060625,
    "potentialProfitPercentage": 34.869507763462174,
    "lastUpdated": "2025-04-26T23:01:56.52237+05:30",
    "dailyChange": "-14.00",
    "dailyChangePercentage": "(-1.14%)",
    "dayRange": "1,207.00 - 1,232.30",
    "marketCap": "157.452B",
    "peRatio": "44.65 27.12",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Bata India Limited manufactures and trades in footwear and accessories through its retail and wholesale network in India and internationally. The company offers footwear for women, men, and kids; apparels; and accessories, such as belts, scarves, socks, handkerchiefs, wallets and clutches, handbags, masks, and shoe and foot care products. It also engages in trading of apparel; and property letting activities. It sells its products primarily under the Bata, Hush Puppies, Nine West, North Star, Power, Bata Red Label, Bata Comfit, Bubblegummers, Disney, Naturalizer, Marie Claire, Scholl, Floatz by Bata, Weinbrenner, Bata Industrials, and Bata 3D brand name through retail and franchisee stores, wholesale network, and e-commerce. The company was formerly known as Bata Shoe Company Private Limited and changed its name to Bata India Limited in 1973. Bata India Limited was incorporated in 1931 and is based in Gurugram, India. Bata India Limited is a subsidiary of Bata (BN) B.V.4,073March 31Consumer Cyclical   Footwear \u0026 Accessories",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "BERGEPAINT": {
    "companyCode": "BERGEPAINT",
    "name": "Berger Paints India Limited (BERGEPAINT.NS)",
    "price": "552.50",
    "week52High": "629.50",
    "week52Low": "437.75",
    "downBy": 77,
    "downByPercentage": 12.231930103256552,
    "potentialProfitPercentage": 13.936651583710407,
    "lastUpdated": "2025-04-26T23:02:11.2501224+05:30",
    "dailyChange": "-32.45",
    "dailyChangePercentage": "(-5.55%)",
    "dayRange": "550.00 - 579.95",
    "marketCap": "683.387B",
    "peRatio": "56.49 9.78",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Berger Paints India Limited manufactures and sells paints for home, professional, and industrial users in India and internationally. The company offers interior wall coatings, including designer finishes, interior emulsions, and ceiling paints; exterior wall coatings comprising exterior emulsions and textures, and roof and floor coatings; specialty industrial coatings; putty and cement paints; solvent, interior, exterior, metal, and wood primers; waterproofing solutions; wood finishes; enamels; aerosol spray paints, and DIY kits and stickers. It also provides automotive, fireproof, protective, floor, and powder coatings; road markings; construction chemicals, flooring compounds, bitumen and coal tar-based products, sealants and adhesives, and anti-corrosive coatings; lacquers; and various sanitization products. In addition, the company offers acrylic, silicate, and mineral plasters; thermal insulation adhesives; mortars; ready to use coat, wood effect, ribbed effect, concrete effect, and 3D effect panels; gel adhesives; and coil coating solutions. The company was formerly known as British Paints (India) Limited and changed its name to Berger Paints India Limited in December 1983. The company was incorporated in 1923 and is based in Kolkata, India. Berger Paints India Limited is a subsidiary of U. K. Paints India Private Limited.4,445March 31Basic Materials   Specialty Chemicals",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "COLPAL": {
    "companyCode": "COLPAL",
    "name": "Colgate-Palmolive (India) Limited (COLPAL.NS)",
    "price": "2,671.40",
    "week52High": "3,890.00",
    "week52Low": "2,311.50",
    "downBy": 1218.6,
    "downByPercentage": 31.326478149100257,
    "potentialProfitPercentage": 45.6165306580819,
    "lastUpdated": "2025-04-26T23:01:32.5098289+05:30",
    "dailyChange": "-60.60",
    "dailyChangePercentage": "(-2.22%)",
    "dayRange": "2,650.50 - 2,735.90",
    "marketCap": "742.751B",
    "peRatio": "49.75 53.70",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Colgate-Palmolive (India) Limited manufactures and trades in personal and oral care products in India. The company offers toothpastes, toothpowder, toothbrushes, mouth wash, rinses, hand washes, and shower gels under the Colgate brand name. It also offers soaps, cosmetics, and toilet preparations. The company exports its products. Colgate-Palmolive (India) Limited was incorporated in 1937 and is headquartered in Mumbai, India.2,221March 31Consumer Defensive   Household \u0026 Personal Products",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "DABUR": {
    "companyCode": "DABUR",
    "name": "Dabur India Limited (DABUR.NS)",
    "price": "484.60",
    "week52High": "672.00",
    "week52Low": "433.30",
    "downBy": 187.39999999999998,
    "downByPercentage": 27.886904761904756,
    "potentialProfitPercentage": 38.67106892282294,
    "lastUpdated": "2025-04-26T23:01:36.3572388+05:30",
    "dailyChange": "-7.10",
    "dailyChangePercentage": "(-1.44%)",
    "dayRange": "480.00 - 493.05",
    "marketCap": "870.918B",
    "peRatio": "47.84 10.13",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Dabur India Limited operates as a fast-moving consumer goods company worldwide. It operates through Consumer Care Business, Foods Business, Retail Business, and Other segments. The company provides oral care products under the Dabur Red Paste, Dabur Meswak, Dabur Babool, Dabur Lal Dant Manjan, Dabur Red Pulling Oil, Dabur Dant Rakshak Ayurvedic Paste, and Dabur Activated Charcoal Toothpaste brands; hair oils under the Dabur Amla, Dabur Almond, Vatika, and Anmol brands; and shampoos under the Vatika brands. It also offers health supplements under the Dabur Chyawanprash, Dabur Honey, Dabur Glucose D, and Dabur Vedic Suraksha Tea brands; fruit juices under the Real and Real Activ brands; cooking pastes under the Hommade brand; milk-based beverages under the Real Milk Power brand; health juices; digestive products under the Dabur Pudin Hara, Dabur Hajmola, and Dabur Nature Care brands; and skin care products under the Dabur Gulabari, Oxylife, and Fem brands. In addition, the company provides mosquito repellents under the Odomos brand name; air fresheners under the Odonil name; and toilet cleaners under the Sanifresh Shine brand name; cough and cold products under the Dabur Honitu brands name; baby massage oil for babies under the Dabur Lal Tail name; baby cream and lotion; and energizers and rejuvenators under the Shilajit and Shilajit Gold brand names. Further, it offers ayurvedic ethical products, such as Dabur Ashokarishta, Dabur lauhasava, shankhpushpi syrup, lavanbhaskar churna, Dabur giloy, churna, Dabur Swarna Guggulu Gold, Dabur abhyarishta, and others. It also operates specialized beauty retail stores that offer a range of cosmetics, fragrances, skin care, and personal care products, as well as beauty and fashion accessories under the NewU brand name. Dabur India Limited was founded in 1884 and is based in Ghaziabad, India.5,367March 31Consumer Defensive   Household \u0026 Personal Products",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "GILLETTE": {
    "companyCode": "GILLETTE",
    "name": "Gillette India Limited (GILLETTE.NS)",
    "price": "8,167.00",
    "week52High": "10,699.00",
    "week52Low": "6,191.00",
    "downBy": 2532,
    "downByPercentage": 23.665763155435087,
    "potentialProfitPercentage": 31.002816211583202,
    "lastUpdated": "2025-04-26T23:01:39.9747843+05:30",
    "dailyChange": "-137.50",
    "dailyChangePercentage": "(-1.66%)",
    "dayRange": "8,045.00 - 8,335.00",
    "marketCap": "270.604B",
    "peRatio": "56.18 145.37",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Gillette India Limited manufactures and sells grooming and oral care products in India and internationally. The company offers shaving system and cartridges, blades, toiletries, razors, and other components. It also offers toothbrushes and oral care products. In addition, the company provides body shaving and trimming, skin care, and aftershave products; and female grooming products under the Venus brand name. The company sells its products primarily under the GilletteLabs, SkinGuard Sensitive, Fusion5, MACH3, Disposable Razor, Guard3, and Styler brand names. Gillette India Limited markets and sells its products through mass merchandisers, grocery stores, membership club stores, drug stores, department stores, and high frequency stores. The company was incorporated in 1984 and is based in Mumbai, India.523June 30Consumer Defensive   Household \u0026 Personal Products",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "GLAXO": {
    "companyCode": "GLAXO",
    "name": "GlaxoSmithKline Pharmaceuticals Limited (GLAXO.NS)",
    "price": "2,802.70",
    "week52High": "3,148.00",
    "week52Low": "1,921.00",
    "downBy": 345.3000000000002,
    "downByPercentage": 10.968869123252865,
    "potentialProfitPercentage": 12.320262603917659,
    "lastUpdated": "2025-04-26T23:02:18.3227749+05:30",
    "dailyChange": "-113.30",
    "dailyChangePercentage": "(-3.89%)",
    "dayRange": "2,780.00 - 2,944.80",
    "marketCap": "494.116B",
    "peRatio": "55.25 50.73",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "GlaxoSmithKline Pharmaceuticals Limited manufactures, distributes, and trades in pharmaceuticals in India and internationally. The company offers vaccines, such as Infanrix Hexa for vaccination of infants against diphtheria, tetanus, pertussis, hepatitis B, poliomyelitis, and disease caused by Haemophilus influenzae type B; Synflorix for active immunization of infants against pneumococcal diseases and acute otitis media; Havrix for active immunization against disease caused by Hepatitis A virus; Menveo to prevent invasive meningococcal disease; Boostrix for immunization against diphtheria, tetanus and pertussis; Fluarix Tetra for the prevention of influenza disease; Varilrix for active immunization against varicella; and Shingrix for prevention of herpes zoster and post-herpetic neuralgia. It also provides specialty medicines comprising NUCALA for severe eosinophilic asthma, eosinophilic granulomatosis with polyangiitis, and hypereosinophilic syndrome; and TRELEGY ELLIPTA for treating chronic obstructive pulmonary disease. In addition, the company offers general medicines, including AUGMENTIN and CEFTUM, which are antibiotics to treat bacterial infections; CALPOL for treatment of mild to moderate pain; ELTROXIN for hypothyroidism; CCM to treat calcium and vitamin D deficiency; NEOSPORIN for treatment and prevention of specific bacterial skin infections; BETNOVATE for skin conditions which require relief of inflammation; T-BACT for bacterial skin infections; and PHYSIOGEL for dry skin and dry skin associated with redness and itch. Further, it develops products for infectious diseases, HIV, oncology, and immunology. The company was formerly known as SmithKline Beecham Pharmaceuticals India Ltd. and changed its name to GlaxoSmithKline Pharmaceuticals Limited in 2001. GlaxoSmithKline Pharmaceuticals Limited was incorporated in 1924 and is headquartered in Mumbai, India.3,211March 31Healthcare   Drug Manufacturers - General",
    "sector": "Healthcare HealthcareHealthcare",
    "industry": ""
  },
  "HAVELLS": {
    "companyCode": "HAVELLS",
    "name": "Havells India Limited (HAVELLS.NS)",
    "price": "1,599.80",
    "week52High": "2,106.00",
    "week52Low": "1,381.30",
    "downBy": 506.20000000000005,
    "downByPercentage": 24.036087369420706,
    "potentialProfitPercentage": 31.641455181897744,
    "lastUpdated": "2025-04-26T23:02:00.5061617+05:30",
    "dailyChange": "-4.80",
    "dailyChangePercentage": "(-0.30%)",
    "dayRange": "1,573.30 - 1,618.70",
    "marketCap": "1.006T",
    "peRatio": "68.02 23.52",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Havells India Limited, a fast-moving electrical goods company, manufactures, trades in, and sells various consumer electrical and electronic products in India and internationally. It operates through six segments: Switchgears, Cables, Lighting and Fixtures, Electrical Consumer Durables, Lloyd Consumer, and Others. The company offers switches; switchgears, such as circuit breakers, energy savers, human safety equipment, distribution boards, surge protection devices, and control and monitoring devices, as well as magnetic contractor, thermal overload relays, and starters; lighting products; and home appliances comprising air conditioners, LED televisions, washing machines, refrigerators, air coolers and purifiers, appliances, personal grooming products, and water heaters and purifiers. It also provides flexible, power, control, and fire survival cables; fans comprising ceiling, table, pedestal, wall, ceiling mounting, personal, and domestic exhaust fans; centrifugal, mono block, submersible, borewell and sewage submersible, pressure, and shallow well jet pumps; dishwashers; air circulators; and heavy-duty exhaust fans. In addition, the company offers crane duty, smoke, brake, inverter duty, and energy efficient motors; reactive power solutions; solar rooftop on grid, solar off grid, and solar on grid inverter solutions; and power solutions, including power capacitors, IOT enabled IPFC relays, HD harmonic detuned reactors, IOT enabled APFC panels, and high PIV thyristor switches. The company offers its products under the Havells, Lloyd, Havells Crabtree, Standard, REO, and Havells Studio brands. It also exports its products approximately to 70 countries. Havells India Limited was founded in 1958 and is based in Noida, India.--March 31Industrials   Electrical Equipment \u0026 Parts",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "HCLTECH": {
    "companyCode": "HCLTECH",
    "name": "HCL Technologies Limited (HCLTECH.NS)",
    "price": "1,578.20",
    "week52High": "2,012.20",
    "week52Low": "1,235.00",
    "downBy": 434,
    "downByPercentage": 21.56843256137561,
    "potentialProfitPercentage": 27.499683183373463,
    "lastUpdated": "2025-04-26T23:01:07.6760678+05:30",
    "dailyChange": "-8.50",
    "dailyChangePercentage": "(-0.54%)",
    "dayRange": "1,568.10 - 1,618.00",
    "marketCap": "4.298T",
    "peRatio": "24.63 64.07",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "HCL Technologies Limited provides IT and business services, engineering and research and development services, and modernized software products and IP-led offerings. It operates through IT and Business Services; Engineering and R\u0026D Services; and HCL Software segments. The company provides application development, management, modernization, and testing, as well as commercial applications; automation services, including digital integration, business process management, robotic process automation for intelligent automation, and low and no code services; digital process operations, such as customer experience management, hyper intelligent automation, supply chain management, finance and accounting, marketing operations and content, and human resource services; and data and AI services consisting of strategy and advisory, modernize data, simplify insights, and scale AI. It also offers commercial applications for sales, accounting, finance, HR, inventory, and manufacturing operations; cybersecurity services; systems engineering, simulation process and data management, manufacturing engineering, supplier collaboration, and digital thread and twin, as well as application, service, and product lifecycle management; and HCLTech Career Shaper, a learning and assessment platform. In addition, the company provides cloud engineering, digital platform engineering, digital commerce and manufacturing, silicon platform solutions, 5G engineering, SemiCloud, and AITech services; and IT enablement and service desk, unified communication and collaboration, workplace assessment and automation, mobility services, and cloud office. Further, it offers intelligent operations, internet of things, marketing services, operational technology, product engineering, supply chain, and unified service management, as well as enterprise network solutions. The company was founded in 1976 and is headquartered in Noida, India.223,420March 31Technology   Information Technology Services",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "HDFCAMC": {
    "companyCode": "HDFCAMC",
    "name": "HDFC Asset Management Company Limited (HDFCAMC.NS)",
    "price": "4,382.50",
    "week52High": "4,864.00",
    "week52Low": "3,415.55",
    "downBy": 481.5,
    "downByPercentage": 9.899259868421053,
    "potentialProfitPercentage": 10.98687963491158,
    "lastUpdated": "2025-04-26T23:02:35.7384911+05:30",
    "dailyChange": "-164.90",
    "dailyChangePercentage": "(-3.63%)",
    "dayRange": "4,367.10 - 4,601.00",
    "marketCap": "972.183B",
    "peRatio": "38.17 114.82",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "HDFC Asset Management Company Limited is a publically owned investment manager. The firm launches and manages equity, fixed income, and balanced mutual funds for its clients. It manages equity, fixed income, balanced, and real estate portfolios. The firm invests in public equity and fixed income markets. The firm employs fundamental analysis to make its investments. HDFC Asset Management Company Limited was founded on December 10, 1999 and is based in Mumbai, Maharashtra. HDFC Asset Management Company Limited operates as a subsidiary of HDFC Bank Limited.--March 31Financial Services   Asset Management",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "HDFCBANK": {
    "companyCode": "HDFCBANK",
    "name": "HDFC Bank Limited (HDFCBANK.NS)",
    "price": "1,911.20",
    "week52High": "1,978.90",
    "week52Low": "1,426.80",
    "downBy": 67.70000000000005,
    "downByPercentage": 3.421092526150894,
    "potentialProfitPercentage": 3.5422771033905427,
    "lastUpdated": "2025-04-26T23:00:53.9934203+05:30",
    "dailyChange": "-5.60",
    "dailyChangePercentage": "(-0.29%)",
    "dayRange": "1,891.80 - 1,933.00",
    "marketCap": "14.674T",
    "peRatio": "20.70 92.31",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "HDFC Bank Limited engages in the provision of banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, Singapore, and Dubai. The company operates in three segments: Treasury, Retail Banking, Wholesale Banking, and Other Banking Services. It accepts savings, salary, current, rural, public provident fund, pension, and demat accounts; fixed and recurring deposits; and safe deposit lockers, as well as offshore accounts and deposits, and overdrafts against fixed deposits. The company also provides personal, home, car, two-wheeler, business, doctor, educational, gold, consumer, and rural loans; loans against properties, securities, mutual funds, rental receivables, and assets; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, healthcare/medical equipment and commercial vehicle finance, dealer finance, and term loans. In addition, it offers credit, debit, prepaid, and forex cards; payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, and merchant and cash management services; insurance and investment products. Further, the company provides short term finance, bill discounting, structured finance, export credit, loan repayment, and documents collection services; online and wholesale, mobile, and phone banking services; unified payment interface, immediate payment, national electronic funds transfer, and real time gross settlement services; and channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. It operates branches and automated teller machines in various cities/towns. The company was incorporated in 1994 and is headquartered in Mumbai, India.214,521March 31Financial Services   Banks - Regional",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "HDFCLIFE": {
    "companyCode": "HDFCLIFE",
    "name": "HDFC Life Insurance Company Limited (HDFCLIFE.NS)",
    "price": "704.55",
    "week52High": "761.20",
    "week52Low": "511.40",
    "downBy": 56.65000000000009,
    "downByPercentage": 7.442196531791918,
    "potentialProfitPercentage": 8.04059328649494,
    "lastUpdated": "2025-04-26T23:02:42.2353143+05:30",
    "dailyChange": "-3.85",
    "dailyChangePercentage": "(-0.54%)",
    "dayRange": "692.65 - 733.50",
    "marketCap": "1.524T",
    "peRatio": "84.08 8.38",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "HDFC Life Insurance Company Limited provides individual and group insurance solutions in India. It offers insurance and investment products, such as protection, pension, savings, investment, annuity, and health, as well as term, retirement, children, and unit linked insurance plans. The company was formerly known as HDFC Standard Life Insurance Company Limited changed its name to HDFC Life Insurance Company Limited in January 2019. HDFC Life Insurance Company Limited was incorporated in 2000 and is headquartered in Mumbai, India. HDFC Life Insurance Company Limited is a subsidiary of HDFC Bank Limited.--March 31Financial Services   Insurance - Life",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "HINDUNILVR": {
    "companyCode": "HINDUNILVR",
    "name": "Hindustan Unilever Limited (HINDUNILVR.NS)",
    "price": "2,332.20",
    "week52High": "3,035.00",
    "week52Low": "2,136.00",
    "downBy": 702.8000000000002,
    "downByPercentage": 23.15650741350907,
    "potentialProfitPercentage": 30.13463682360004,
    "lastUpdated": "2025-04-26T23:01:18.273723+05:30",
    "dailyChange": "+6.90",
    "dailyChangePercentage": "+(0.30%)",
    "dayRange": "2,294.40 - 2,341.90",
    "marketCap": "5.48T",
    "peRatio": "51.55 45.24",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Hindustan Unilever Limited, a fast-moving consumer good company, manufactures and sells food, home care, personal care, and refreshment products in India and internationally. The company operates through Home Care, Beauty \u0026 Personal Care, Foods \u0026 Refreshment, and Others segments. The Home Care segment engages in detergent bars and powders, detergent liquids, scourers, water business, purifiers business, etc. The Beauty \u0026 Personal Care segment provides oral, skin, and hair care products; and soaps, deodorants, talcum powder, color cosmetics, salon services, etc. The Foods \u0026 Refreshment segment provides culinary products, including tomato-based products, fruit-based products, soups, etc.; and tea, coffee, nutrition drinks, ice-cream, and frozen desserts. The Others segment engages in activities, such as export, consignment, etc. The company is also involved in the job work, real estate, and discharge trust businesses. The company was founded in 1888 and is headquartered in Mumbai, India.--March 31Consumer Defensive   Household \u0026 Personal Products",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "ICICIBANK": {
    "companyCode": "ICICIBANK",
    "name": "ICICI Bank Limited (ICICIBANK.NS)",
    "price": "1,404.80",
    "week52High": "1,436.00",
    "week52Low": "1,051.05",
    "downBy": 31.200000000000045,
    "downByPercentage": 2.1727019498607274,
    "potentialProfitPercentage": 2.220956719817771,
    "lastUpdated": "2025-04-26T23:00:57.835175+05:30",
    "dailyChange": "+2.10",
    "dailyChangePercentage": "+(0.15%)",
    "dayRange": "1,388.40 - 1,414.80",
    "marketCap": "10.01T",
    "peRatio": "19.76 71.08",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "ICICI Bank Limited, together with its subsidiaries, engages in the provision of various banking and financial services to retail and corporate customers in India and internationally. The company operates through Retail Banking, Wholesale Banking, Treasury, Other Banking, Life Insurance, and Others segments. It accepts savings, salary, pension, current, trade, escrow, foreign currency, and vostro accounts, as well as time, fixed, recurring, and security deposits services. The company also provides home, car, two-wheeler, personal, gold, and commercial business loans, as well as loans against securities and other loans; business loans, including working capital finance, term loans, collateral free loans, loans without financials, finance for importers and exporters, and overdraft facilities, as well as loans for new entities and card swipes; and credit, debit, prepaid, travel, forex, and corporate cards. In addition, it offers pockets wallet; fixed income products; investment products, such as mutual funds, gold monetization schemes, initial public offerings, and other online investment services; and agri and rural business, farmer finance, tractor loans, and micro banking services. Further, the company provides portfolio management, trade, foreign exchange, locker, private and NRI banking, and cash management services; family wealth and demat accounts; commercial and investment banking, capital market, custodial, and institutional banking services; health, personal accident, fire, and motor insurance, as well as distributes general and life insurance products; and Internet, mobile, and phone banking services. Additionally, it offers securities investment, broking, trading, and underwriting services; and merchant banking, trusteeship, housing finance, pension fund management, asset management, investment advisory, points of presence, and private equity/venture capital fund management services. The company was founded in 1955 and is headquartered in Mumbai, India.--March 31Financial Services   Banks - Regional",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "ICICIGI": {
    "companyCode": "ICICIGI",
    "name": "ICICI Lombard General Insurance Company Limited (ICICIGI.NS)",
    "price": "1,854.10",
    "week52High": "2,301.90",
    "week52Low": "1,480.50",
    "downBy": 447.8000000000002,
    "downByPercentage": 19.453494938963473,
    "potentialProfitPercentage": 24.151879618143585,
    "lastUpdated": "2025-04-26T23:02:48.7142485+05:30",
    "dailyChange": "-26.20",
    "dailyChangePercentage": "(-1.39%)",
    "dayRange": "1,832.20 - 1,908.70",
    "marketCap": "932.586B",
    "peRatio": "36.50 50.80",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "ICICI Lombard General Insurance Company Limited provides various general insurance products and services in India. The company primarily offers fire, marine, cargo, engineering, aviation, public/product liability, employee group, workmen's compensation, cyber, personal accident, and travel insurance solutions. It also provides credit, crop, cattle, weather, group and mass health, and motor, as well as home insurance solutions. In addition, the company offers underwriting and claims, customer relationship, technology, operations, finance and accounts, human resources, legal and compliance, actuarial, marketing, business analytics, administration, and fraud control, as well as reinsurance solutions. It serves its customers comprising individuals, corporates, state and central governments, government-owned enterprises, and rural customers, as well as micro, small, and medium enterprises through agents, brokers, bancassurance, tele-sales, direct alliances, motor insurance service providers, and online platforms. The company was incorporated in 2000 and is based in Mumbai, India. ICICI Lombard General Insurance Company Limited operates as a subsidiary of ICICI Bank Limited.--March 31Financial Services   Insurance - Diversified",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "ICICIPRULI": {
    "companyCode": "ICICIPRULI",
    "name": "ICICI Prudential Life Insurance Company Limited (ICICIPRULI.NS)",
    "price": "595.80",
    "week52High": "796.80",
    "week52Low": "515.45",
    "downBy": 201,
    "downByPercentage": 25.225903614457835,
    "potentialProfitPercentage": 33.73615307150051,
    "lastUpdated": "2025-04-26T23:02:45.3938076+05:30",
    "dailyChange": "-6.55",
    "dailyChangePercentage": "(-1.09%)",
    "dayRange": "585.00 - 618.60",
    "marketCap": "870.142B",
    "peRatio": "73.01 8.16",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "ICICI Prudential Life Insurance Company Limited provides life insurance, pension, and health insurance products to individuals and groups in India. The company offers term life, savings, protection, annuity, and retirement insurance products; and pension fund management services. It distributes its products through individual and corporate agents, banks, and brokers, as well as through its sales force and website. The company was incorporated in 2000 and is based in Mumbai, India. ICICI Prudential Life Insurance Company Limited operates as a subsidiary of ICICI Bank Limited.--March 31Financial Services   Insurance - Life",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "INFY": {
    "companyCode": "INFY",
    "name": "Infosys Limited (INFY.NS)",
    "price": "1,480.20",
    "week52High": "2,006.45",
    "week52Low": "1,307.00",
    "downBy": 526.25,
    "downByPercentage": 26.227914974208176,
    "potentialProfitPercentage": 35.5526280232401,
    "lastUpdated": "2025-04-26T23:01:11.3398149+05:30",
    "dailyChange": "+8.80",
    "dailyChangePercentage": "+(0.60%)",
    "dayRange": "1,463.50 - 1,501.70",
    "marketCap": "6.133T",
    "peRatio": "22.78 64.98",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides digital marketing and digital workplace, digital commerce, digital experience and interactions, metaverse, data analytics and AI, applied AI, generative AI, sustainability, blockchain, engineering, Internet of Things, enterprise agile DevOps, application modernization, cloud, digital process automation, digital supply chain, Microsoft business application and cloud business, service experience transformation, energy transition, cyber security, and quality engineering solutions; Oracle, SAP, and Saleforce solutions; API economy and microservices; and Topaz, an AI-first set of services, solutions, and platforms using generative AI technologies. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Panaya platform, Infosys Equinox, Infosys Helix, Infosys Applied AI, Infosys Cortex, and Stater digital platforms; and Infosys McCamish, an insurance platform. It serves aerospace and defense, agriculture, automotive, chemical manufacturing, communication, consumer packaged goods, education, engineering procurement and construction, healthcare, high technology, industrial manufacturing, information services and publishing, insurance, life science, logistics and distribution, media, entertainment, mining, oil and gas, private equity, professional, public, retail, travel, hospitality, utilities, and waste management industries. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was incorporated in 1981 and is headquartered in Bengaluru, India.300,000March 31Technology   Information Technology Services",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "ITC": {
    "companyCode": "ITC",
    "name": "ITC Limited (ITC.NS)",
    "price": "427.80",
    "week52High": "528.50",
    "week52Low": "390.15",
    "downBy": 100.69999999999999,
    "downByPercentage": 19.053926206244086,
    "potentialProfitPercentage": 23.539036933146328,
    "lastUpdated": "2025-04-26T23:01:46.8441744+05:30",
    "dailyChange": "-2.25",
    "dailyChangePercentage": "(-0.52%)",
    "dayRange": "423.30 - 432.70",
    "marketCap": "5.382T",
    "peRatio": "26.52 16.13",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "ITC Limited engages in the fast-moving consumer goods, hotels, paperboards and paper and packaging, agri, and information technology businesses in India and internationally. It primarily offers cigarettes and cigars; staples, spices, biscuits, confectionery and gums, snacks, noodles and pasta, beverages, dairy, ready to eat meals, chocolate, coffee, and frozen foods; personal care products; notebooks, pens and pencils, geometry boxes, erasers, sharpeners, rulers, wax and plastic crayons, sketch pens, and oil pastels; safety matches; and incense sticks under various brands. The company also operates hotels under the ITC Hotel, Mementos, Welcomhotel, Storii, Fortune, and WelcomHeritage brands; and Kaya Kalp spas. In addition, it offers virgin, recycled, coated barrier, cupstock base, liner, liquid packaging, anti-fungal, solid, and graphic boards, as well as specialty papers; overlay, surfacing/print base, barrier, and liner papers; plastic substitution products; and packaging products, such as carton board, flexible, tobacco, and green packaging products. Further, the company exports feed ingredients, food grains, marine products, processed fruits, coffee products, leaf tobacco products, and spices; and offers information technology services for the banking, financial services, consumer goods, manufacturing, travel, hospitality, and healthcare industries. Additionally, it provides property infrastructure and estate maintenance; engineering, procurement, and construction management; project management consultancy; cartooning and wrapping; conveyor; and business consulting, real estate development, and agro-forestry and other related services. The company also manages and operates golf courses; fabricates and assembles machinery for tube filling; and produces and commercializes seed potato technology products. ITC Limited was incorporated in 1910 and is headquartered in Kolkata, India.37,312March 31Consumer Defensive   Tobacco",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "KOTAKBANK": {
    "companyCode": "KOTAKBANK",
    "name": "Kotak Mahindra Bank Limited (KOTAKBANK.NS)",
    "price": "2,204.40",
    "week52High": "2,301.90",
    "week52Low": "1,543.85",
    "downBy": 97.5,
    "downByPercentage": 4.235631434901603,
    "potentialProfitPercentage": 4.422972237343495,
    "lastUpdated": "2025-04-26T23:01:04.2444287+05:30",
    "dailyChange": "-18.60",
    "dailyChangePercentage": "(-0.84%)",
    "dayRange": "2,178.20 - 2,233.40",
    "marketCap": "4.42T",
    "peRatio": "19.72 111.76",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Kotak Mahindra Bank Limited provides a range of banking and financial services to corporate and individual customers in India. It operates through Treasury, BMU and Corporate Centre; Retail Banking; Corporate / Wholesale Banking; Digital Banking; Other Retail Banking; Vehicle Financing; Other Lending Activities; Broking; Advisory and Transactional Services; Asset Management; and Insurance segments. The company offers savings, current, and salary accounts; fixed, recurring, tax saving fixed, senior citizen, and fixed deposit products; home, personal, business, payday, gold, education, commercial vehicle, car, and crop loans, as well as loan against securities and properties; construction equipment, farm equipment, healthcare, trade and supply chain, and working capital finance solutions; and prepaid, credit, and debit cards. It also provides Investment products; life, term, health, car, and two wheeler insurance; payment services; trade services; business management and marketing, enterprise resource planning, supply chain and logistics, human resource, business travel, workspace management, taxation and legal, and healthcare/medical equipment services; cash management services, such as digital payments, physical collections, digital collections, and payment gateways; private banking services; net banking; and NRI services. Kotak Mahindra Bank Limited was incorporated in 1985 and is based in Mumbai, India.116,000March 31Financial Services   Banks - Regional",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "MARICO": {
    "companyCode": "MARICO",
    "name": "Marico Limited (MARICO.NS)",
    "price": "710.40",
    "week52High": "736.90",
    "week52Low": "510.45",
    "downBy": 26.5,
    "downByPercentage": 3.5961460170986568,
    "potentialProfitPercentage": 3.7302927927927927,
    "lastUpdated": "2025-04-26T23:01:43.1871027+05:30",
    "dailyChange": "-2.35",
    "dailyChangePercentage": "(-0.33%)",
    "dayRange": "706.20 - 722.30",
    "marketCap": "921.993B",
    "peRatio": "57.48 12.36",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Marico Limited, together with its subsidiaries, manufactures and sells consumer products in India. It offers coconut oils, refined edible oils, hair oils, anti-lice treatments, fabric care, functional and other processed foods, hair creams and gels, hair serums, shampoos, shower gels, shower gels, hair relaxers and straighteners, deodorants, fabric care, female personal care, baby care, skin care, male grooming and styling, health care, and hygiene products, as well as conditioners. The company markets its products under the Parachute, Saffola, Saffola FITTIFY Gourmet, Saffola ImmuniVeda, Saffola Mealmaker, Hair \u0026 Care, Parachute Advansed, Nihar Naturals, Mediker, Pure Sense, Coco Soul, Revive, Set Wet, Livon, Just Herbs, True Elements, Beardo, and Plix brand names in India; and under the Parachute, Parachute Advansed, HairCode, Fiance, Purit de Prvence, liv, Lashe', Caivil, Hercules, Black Chic, Code 10, Ingwe, X-Men, Thuan Phat and Isoplus brand names internationally. Its distribution network comprises regional offices, carrying and forwarding agents, redistribution centers, and distributors. The company was incorporated in 1988 and is headquartered in Mumbai, India.1,834March 31Consumer Defensive   Household \u0026 Personal Products",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "NAM-INDIA": {
    "companyCode": "NAM-INDIA",
    "name": "Nippon Life India Asset Management Limited (NAM-INDIA.NS)",
    "price": "640.20",
    "week52High": "816.25",
    "week52Low": "498.05",
    "downBy": 176.04999999999995,
    "downByPercentage": 21.56814701378254,
    "potentialProfitPercentage": 27.499218994064346,
    "lastUpdated": "2025-04-26T23:02:39.0805401+05:30",
    "dailyChange": "-30.70",
    "dailyChangePercentage": "(-4.58%)",
    "dayRange": "632.10 - 676.45",
    "marketCap": "427.218B",
    "peRatio": "30.87 20.74",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Nippon Life Asset Management Limited is a publicly owned investment manager. The firm launches and manages equity and fixed income mutual funds for its clients. It also manages exchange traded funds for its clients. The firm invests in the public equity, fixed income and commodity markets. Nippon Life Asset Management Limited was previously known as Reliance Nippon Life Asset Management Limited. Nippon Life Asset Management Limited was founded on February 24, 1995 and is based in Mumbai, India.1,004March 31Financial Services   Asset Management",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "NESTLEIND": {
    "companyCode": "NESTLEIND",
    "name": "Nestl India Limited (NESTLEIND.NS)",
    "price": "2,413.50",
    "week52High": "2,778.00",
    "week52Low": "2,110.00",
    "downBy": 364.5,
    "downByPercentage": 13.120950323974082,
    "potentialProfitPercentage": 15.102548166563082,
    "lastUpdated": "2025-04-26T23:01:21.5336322+05:30",
    "dailyChange": "-19.70",
    "dailyChangePercentage": "(-0.81%)",
    "dayRange": "2,387.30 - 2,435.20",
    "marketCap": "2.346T",
    "peRatio": "72.46 33.31",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Nestl India Limited manufactures and sells food products in India and internationally. It provides milk products and nutrition, including dairy whitener, condensed and UHT milk, yoghurt, maternal and infant formula, baby food, and health care nutrition products; powdered and liquid beverages comprising instant coffee and tea, as well as ready to drink beverages; prepared dishes and cooking aids, such as noodles, sauces, seasonings, pasta, cereals, and pet foods; and confectionery products consisting of bar countlines, tablets, and sugar confectionery products. The company was incorporated in 1959 and is headquartered in Gurugram, India.--March 31Consumer Defensive   Packaged Foods",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "PAGEIND": {
    "companyCode": "PAGEIND",
    "name": "Page Industries Limited (PAGEIND.NS)",
    "price": "44,605.00",
    "week52High": "49,849.95",
    "week52Low": "33,870.00",
    "downBy": 5244.949999999997,
    "downByPercentage": 10.521474946313884,
    "potentialProfitPercentage": 11.758659343122961,
    "lastUpdated": "2025-04-26T23:01:53.1789056+05:30",
    "dailyChange": "-410.00",
    "dailyChangePercentage": "(-0.91%)",
    "dayRange": "43,900.00 - 45,480.00",
    "marketCap": "502.087B",
    "peRatio": "74.07 602.17",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Page Industries Limited manufactures, markets, and distributes textile garments and clothing accessories for men, women, and junior girls and boys in India and internationally. The company offers vests, briefs, boxer briefs, trunks, inner boxers, tank tops, t-shirts, polos, henleys, sweatshirts, jackets, hoodies, boxer shorts, shorts, bermudas, joggers, track pants, pyjamas, pants, bras, panties, crop tops, camisoles, kurta and kurti slips, shrugs, sleep dresses, capris, leggings, shapewears, caps, handkerchief, and masks; face, hand, bath, and gym towels; calf, ankle, knee, low show, and no show socks; and thermals under Jockey brand. It also provides swimwear, swimactive, equipment, and footwear under the Speedo brand. The company sells its products through stores and online channels. Page Industries Limited was incorporated in 1994 and is headquartered in Bengaluru, India.19,461March 31Consumer Cyclical   Apparel Manufacturing",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "PFIZER": {
    "companyCode": "PFIZER",
    "name": "Pfizer Limited (PFIZER.NS)",
    "price": "4,248.90",
    "week52High": "6,451.15",
    "week52Low": "3,701.00",
    "downBy": 2202.25,
    "downByPercentage": 34.13732435302233,
    "potentialProfitPercentage": 51.83106215726424,
    "lastUpdated": "2025-04-26T23:02:24.9488579+05:30",
    "dailyChange": "-27.00",
    "dailyChangePercentage": "(-0.63%)",
    "dayRange": "4,177.00 - 4,365.00",
    "marketCap": "195.613B",
    "peRatio": "31.55 134.69",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Pfizer Limited engages in manufacturing, marketing, trading, and export of pharmaceutical products in India and internationally. It offers its products in various therapeutic areas, including neuro/CNS, hormones, cardiovascular, haemophilia, anti-infectives, gynecology, pain/analgesics, orthopedic, oncology, urology, anti-parasitic, gastro intestinal, vaccines, and respiratory, as well as vitamins, minerals, and nutrients. The company also offers internal medicine and anti-infectives services to hospitals and nursing homes. It serves healthcare providers, government and private hospitals, and retail pharmacies. The company sells its products through a network of independent distributors. Pfizer Limited was incorporated in 1950 and is based in Mumbai, India.1,721March 31Healthcare   Drug Manufacturers - General",
    "sector": "Healthcare HealthcareHealthcare",
    "industry": ""
  },
  "PGHH": {
    "companyCode": "PGHH",
    "name": "Procter \u0026 Gamble Hygiene and Health Care Limited (PGHH.NS)",
    "price": "14,221.00",
    "week52High": "17,745.00",
    "week52Low": "12,105.60",
    "downBy": 3524,
    "downByPercentage": 19.859115243730628,
    "potentialProfitPercentage": 24.78025455312566,
    "lastUpdated": "2025-04-26T23:01:24.9040098+05:30",
    "dailyChange": "-176.00",
    "dailyChangePercentage": "(-1.22%)",
    "dayRange": "14,054.00 - 14,427.00",
    "marketCap": "467.338B",
    "peRatio": "64.51 220.43",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Procter \u0026 Gamble Hygiene and Health Care Limited engages in the manufacture and sale of branded packaged fast-moving consumer goods in the feminine care and healthcare businesses in India and internationally. It operates through Healthcare Products and Hygiene Products segments. The company provides health care products, including ointments and creams, cough drops, and tablets; and hygiene products, such as feminine hygiene and other skin care hygiene products, as well as feminine care pads. It also offers baby care products comprising nappies, pants, and baby wipes; grooming products; laundry products; hair care products; home care products; and oral care products. The company offers its products under the Vicks, Whisper, Pampers, Ariel, Tide, Gillette, Head \u0026 Shoulders, Herbal Essences, Pantene, Ambi Pur, Oral-B, Olay, and Old Spice brand names. It sells its products through mass merchandisers, as well as grocery, membership club, drug, department, and high frequency stores. The company was incorporated in 1964 and is based in Mumbai, India. Procter \u0026 Gamble Hygiene and Health Care Limited operates as a subsidiary of The Procter \u0026 Gamble Company.439June 30Consumer Defensive   Household \u0026 Personal Products",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "PIDILITIND": {
    "companyCode": "PIDILITIND",
    "name": "Pidilite Industries Limited (PIDILITIND.NS)",
    "price": "3,011.20",
    "week52High": "3,415.00",
    "week52Low": "2,622.20",
    "downBy": 403.8000000000002,
    "downByPercentage": 11.824304538799419,
    "potentialProfitPercentage": 13.40993623804464,
    "lastUpdated": "2025-04-26T23:01:28.6165335+05:30",
    "dailyChange": "-65.20",
    "dailyChangePercentage": "(-2.12%)",
    "dayRange": "2,985.00 - 3,094.80",
    "marketCap": "1.565T",
    "peRatio": "78.74 38.24",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Pidilite Industries Limited, together with its subsidiaries, engages in the manufacture and sale of consumer and specialty chemicals in India and internationally. The company operates in two segments Branded Consumer \u0026 Bazaar, and Business to Business. The Branded Consumer \u0026 Bazaar segment offers adhesives, sealants, art and craft materials; and construction and paint chemicals for use by carpenters, painters, plumbers, mechanics, households, students, offices, etc. The Business to Business segment provides industrial adhesives and resins, construction chemicals, organic pigments, pigment preparations, etc. for use in various industries, including packaging, joineries, textiles, paints, printing inks, paper, leather, etc. It sells its products primarily under the Fevicol, Fevicol MR, Dr. Fixit, Fevikwik, M-Seal, Fevistick, Fevicryl, Fevigum, Rangeela, WD-40, MOTO MAX, Terminator, WUDFIN, HAI SHA, steelgrip, Araldite, Roff, and other brands. The company was founded in 1959 and is based in Mumbai, India.7,914March 31Basic Materials   Specialty Chemicals",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "RELIANCE": {
    "companyCode": "RELIANCE",
    "name": "Reliance Industries Limited (RELIANCE.NS)",
    "price": "1,300.40",
    "week52High": "1,608.80",
    "week52Low": "1,114.85",
    "downBy": 308.39999999999986,
    "downByPercentage": 19.16956737941322,
    "potentialProfitPercentage": 23.71577976007381,
    "lastUpdated": "2025-04-26T23:00:47.0486467+05:30",
    "dailyChange": "-1.20",
    "dailyChangePercentage": "(-0.09%)",
    "dayRange": "1,288.10 - 1,325.20",
    "marketCap": "17.614T",
    "peRatio": "25.44 51.11",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Reliance Industries Limited engages in hydrocarbon exploration and production, oil and chemicals, textile, retail, digital, material and composites, renewables, and financial services businesses worldwide. It operates through Oil to Chemicals, Oil and Gas, Retail, Digital Services, and Others segments. The company produces and markets petroleum products, such as liquefied petroleum gas, propylene, naphtha, gasoline, jet/aviation turbine fuel, kerosene oil, diesel, sulphur, and petroleum coke. It also provides petrochemicals, including high-density and low-density polyethylene (PE), linear low-density PE, polyester fibers and yarns, polypropylene, polyvinyl chloride, purified terephthalic acid, ethylene glycols and oxide, paraxylene, ortho xylene, benzene, linear alkyl benzene and paraffin, poly butadiene rubber, styrene butadiene rubber, butyl rubber, and polyethylene terephthalate. In addition, the company manufactures and markets yarns, fabrics, apparel, and auto furnishings; explores, develops, and produces crude oil and natural gas; and operates various stores comprising neighborhood, supermarket, hypermarket, wholesale cash and carry, specialty, online stores, as well as stores that offer apparel, beauty and cosmetics, accessories, footwear, consumer electronics, connectivity products, and others. Further, the company provides range of digital television, gaming, broadband, and telecommunication services under the Jio brand name; and non-banking financial and insurance broking services. Additionally, it operates news and entertainment platforms, and Network18 and television channels; publishes magazines; and offers highway hospitality and fleet management services. The company was founded in 1957 and is based in Mumbai, India.--March 31Energy   Oil \u0026 Gas Refining \u0026 Marketing",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "SANOFI": {
    "companyCode": "SANOFI",
    "name": "Sanofi India Limited (SANOFI.NS)",
    "price": "6,273.00",
    "week52High": "10,524.95",
    "week52Low": "4,902.00",
    "downBy": 4251.950000000001,
    "downByPercentage": 40.39876673998452,
    "potentialProfitPercentage": 67.78176311174877,
    "lastUpdated": "2025-04-26T23:02:28.6615828+05:30",
    "dailyChange": "-296.50",
    "dailyChangePercentage": "(-4.51%)",
    "dayRange": "6,201.00 - 6,469.50",
    "marketCap": "151.323B",
    "peRatio": "46.08 136.12",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Sanofi India Limited manufactures and trades in drugs and pharmaceutical products in India, Singapore and internationally. The company provides pharmaceutical products in various therapeutic areas, such as diabetes, cardiology, thrombosis, infections, epilepsy, anti-infectives, and central nervous system, as well as allergy, pain care, digestive, and nutritional health under the Lantus, Toujeo, Soliqua, Clexane, Amaryl, Cardace, Lasix, Lasilactone, Glimepiride, Cetapin, Targocid, Frisium, Targocio, Combiflam, DePura, Allegra, Baralgan, BUSCOGAST, Dulcoflex, Enterogermina, Novalgin, and Avil brands through independent distributors. It also exports its products to approximately 24 countries. The company was formerly known as Aventis Pharma Limited and changed its name to Sanofi India Limited in May 2012. The company was incorporated in 1956 and is headquartered in Mumbai, India. Sanofi India Limited is a subsidiary of Hoechst GmbH.1,225December 31Healthcare   Drug Manufacturers - General",
    "sector": "Healthcare HealthcareHealthcare",
    "industry": ""
  },
  "TCS": {
    "companyCode": "TCS",
    "name": "Tata Consultancy Services Limited (TCS.NS)",
    "price": "3,448.00",
    "week52High": "4,592.25",
    "week52Low": "3,056.05",
    "downBy": 1144.25,
    "downByPercentage": 24.916979694049758,
    "potentialProfitPercentage": 33.18590487238979,
    "lastUpdated": "2025-04-26T23:01:14.5865078+05:30",
    "dailyChange": "+46.40",
    "dailyChangePercentage": "+(1.36%)",
    "dayRange": "3,405.00 - 3,477.80",
    "marketCap": "12.475T",
    "peRatio": "25.71 134.13",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Tata Consultancy Services Limited provides information technology (IT) and IT enabled services in the Americas, Europe, India, and internationally. It operates through Banking, Financial Services and Insurance; Manufacturing; Consumer Business; Communication, Media and Technology; Life Sciences and Healthcare; and Others segments. The company provides TCS ADD, a suite of technology platforms for clinical research and drug development; TCS BaNCS, a financial services platform; TCS BFSI Platforms, a cloud-native, as-a-service that helps financial institutions and insurance firms; TCS CHROMA, a cloud-based workforce management solution; customer intelligence and insight solutions; TCS ERP on Cloud, a hosted ERP applications and services platform; TCS HOBS, a cloud-native catalog-centric platform for personalization of products and processes; and ignio, an autonomous enterprise software. It also offers TCS Intelligent Urban Exchange for smart cities and enterprises solution; TCS OmniStore, a retail commerce platform; TCS Optumera, a retail-connected strategic intelligence platform; TCS TAP, a procurement offering; TCS MasterCraft, a platform of intelligent automation products; Quartz- the Smart Ledgers, a blockchain solution; Jile, an enterprise agile planning and delivery tool; TCS iON, an IT-as-a-Service model that provides business solutions; and TCS TwinX, an enterprise digital twin platform. In addition, the company offers cloud, cognitive business, consulting, cybersecurity, data and analytics, enterprise solutions, Internet of Things and digital engineering, TCS interactive, and sustainability services. It serves banking; capital markets; consumer goods and distribution; communications, media, and information services; education; energy, resources, and utilities; healthcare; high technology; insurance; life sciences; manufacturing; public services; retail; and travel and logistics industries. The company was founded in 1968 and is based in Mumbai, India. Tata Consultancy Services Limited is a subsidiary of Tata Sons Private Limited.607,979March 31Technology   Information Technology Services",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "TITAN": {
    "companyCode": "TITAN",
    "name": "Titan Company Limited (TITAN.NS)",
    "price": "3,365.20",
    "week52High": "3,867.00",
    "week52Low": "2,925.00",
    "downBy": 501.8000000000002,
    "downByPercentage": 12.97646754590122,
    "potentialProfitPercentage": 14.911446570783319,
    "lastUpdated": "2025-04-26T23:01:49.9288525+05:30",
    "dailyChange": "-17.40",
    "dailyChangePercentage": "(-0.51%)",
    "dayRange": "3,316.00 - 3,419.50",
    "marketCap": "3.001T",
    "peRatio": "92.60 36.34",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Titan Company Limited, together with its subsidiaries, manufactures and sells watches, jewelry, eyewear, and other accessories and products in India and internationally. It operates through four segments: Watches and Wearables, Jewellery, Eyecare, and Others. The company designs, manufactures, and retails watches and wearables under the Nebula by Titan, Xylys, Edge by Titan, Raga by Titan, Titan, Fastrack, Vyb by Fastrack, Sonata, POZE Sonata, ZOOP by Titan, Titan Clocks, Octane Titan, Fastrack Smart, Titan Smart, SF, Titan World, and Helios brands; jewelry products under the Mia by Tanishq, CaratLane, Tanishq, and Zoya brand names; and eyecare products under the Titan EyePlus and Fastrack Eyecare brands. It also offers sarees, dress materials, and ready-to-wear kurtas under the Taneira brand; perfumes under the SKINN by Titan brand name; belts and wallets under the TITAN brand; and bags under the Fastrack and IRTH brand names. In addition, it provides manufacturing services and automation solutions for aerospace, defense, transportation, electrical and electronics, and medical sectors. It offers its products through owned and franchised retail stores, as well as online. The company was formerly known as Titan Industries Limited and changed its name to Titan Company Limited in August 2013. Titan Company Limited was incorporated in 1984 and is based in Bengaluru, India.8,680March 31Consumer Cyclical   Luxury Goods",
    "sector": "Healthcare Healthcare",
    "industry": ""
  },
  "WHIRLPOOL": {
    "companyCode": "WHIRLPOOL",
    "name": "Whirlpool of India Limited (WHIRLPOOL.NS)",
    "price": "1,156.55",
    "week52High": "2,449.70",
    "week52Low": "899.00",
    "downBy": 1293.1499999999999,
    "downByPercentage": 52.788096501612436,
    "potentialProfitPercentage": 111.81098958108167,
    "lastUpdated": "2025-04-26T23:02:04.3146862+05:30",
    "dailyChange": "-30.50",
    "dailyChangePercentage": "(-2.57%)",
    "dayRange": "1,126.65 - 1,189.00",
    "marketCap": "150.781B",
    "peRatio": "46.30 24.98",
    "eps": "",
    "ytdReturn": "",
    "oneYearReturn": "",
    "threeYearReturn": "",
    "fiveYearReturn": "",
    "totalCash": "",
    "debtToEquity": "",
    "companyProfile": "Whirlpool of India Limited manufactures and markets home appliances in India and internationally. It offers refrigerators, washing machines, air conditioners, microwave ovens, dishwasher, kitchen, built-in, and small appliances. The company was incorporated in 1960 and is headquartered in Gurugram, India. Whirlpool of India Limited operates as a subsidiary of Whirlpool Corporation.2,364March 31Consumer Cyclical   Furnishings, Fixtures \u0026 Appliances",
    "sector": "Healthcare Healthcare",
    "industry": ""
  }
}